src/Catalogs/КИИ_ЭкспертыИИ/КИИ_ЭкспертыИИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КИИ_ЭкспертыИИ</name>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.КИИ_МоделиИИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЭксперта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КатегорииЗнаний</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КИИ_КатегорииЗнаний</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/КИИ_ЭкспертыИИ/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновитьСведенияЗнанийЭксперта();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ОбновитьСведенияЗнанийЭксперта();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ОбновитьСведенияЗнанийЭксперта();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПоискЗнаний(Команда)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр(
			"ru = 'Сначала запишите карточку. Проверка использует записанные знания и категории.'"));
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Обработка.КИИ_ПроверкаПоискаЗнаний.Форма.Форма",
		Новый Структура("ЭкспертПоиска", Объект.Ссылка));

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКатегориюЗнаний(Команда)

	Данные = Элементы.КатегорииЗнаний.ТекущиеДанные;
	Если Данные <> Неопределено И ЗначениеЗаполнено(Данные.Категория) Тогда
		ПоказатьЗначение(, Данные.Категория);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСведенияЗнанийЭксперта()

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СостояниеЗнанийЭксперта = НСтр(
			"ru = 'Запишите карточку после выбора категорий. Здесь будет показана готовность подключенных знаний.'");
		Возврат;
	КонецЕсли;
	Сведения = КИИ_RAG.СведенияДляПроверкиПоиска(Объект.Ссылка);
	СостояниеЗнанийЭксперта = Сведения.Диагностика;
	Если ЗначениеЗаполнено(Сведения.Модель) Тогда
		СостояниеЗнанийЭксперта = СостояниеЗнанийЭксперта + Символы.ПС
			+ СтрШаблон(НСтр("ru = 'Модель для поиска знаний: %1.'"), Строка(Сведения.Модель));
	КонецЕсли;
	СостояниеЗнанийЭксперта = СостояниеЗнанийЭксперта + Символы.ПС
		+ НСтр("ru = 'Проверка использует записанные категории. После изменения списка запишите карточку.'");

КонецПроцедуры

#КонецОбласти
